{
    "title": "Agile Base Board",
    "columns": [
        "To Do",
        "In Progress",
        "Done"
    ],
    "items": [
        {
            "text": "Add export to GitHub: 1. Exports the content of the board in a JSON format, and keeps it in the copy buffer; 2. Then opens GitHub edit link to the previously imported JSON export stored in GitHub.",
            "column": "To Do"
        },
        {
            "text": "Add JIRA export file - one which can be imported in JIRA later.",
            "column": "To Do"
        },
        {
            "text": "Add Export options menu with 3 Options: 1. JSON, 2. GitHub 3. JIRA",
            "column": "To Do"
        },
        {
            "text": "Add an icon button at the top left for switching between multiple column mode ▮▯▯ (kanban) and single column mode ▯ (list)",
            "column": "To Do"
        },
        {
            "text": "Add a switch button to turn on or off local browser storage board caching - default on. \n1ver. -  May be the button can be show cache hide cache, that would allow for using the same board for intermittent work without breaking the cache. May additional clear cache button beside this one.\n2 ver. - May be the switch button clear the cache on turn-off and strarts the caching again on turn-on.\n3 ver. - May be both are valid behaviors and can be configured from a configuration.",
            "column": "To Do"
        },
        {
            "text": "Fix flaky behavior on tap /delete buttons and typing/ on mobile",
            "column": "To Do"
        },
        {
            "text": "Investigate what is best to do with the separate page and column vertical scrolls, to create better UX.",
            "column": "To Do"
        },
        {
            "text": "Add ID to the item - generated based on the board name.",
            "column": "To Do"
        },
        {
            "text": "Add dark/night mode",
            "column": "To Do"
        },
        {
            "text": "Add title to the items",
            "column": "To Do"
        },
        {
            "text": "Add estimation to the items",
            "column": "To Do"
        },
        {
            "text": "Add color flag to the items",
            "column": "To Do"
        },
        {
            "text": "Add configuration accessible through the sandwich menu, to configure basic/advanced mode. Advanced mode will include the title, color flag, ID, estimation, etc. Basic will be just flat items with text only.",
            "column": "To Do"
        },
        {
            "text": "Add a function to transform head and web repo import URLs to raw URL's from the main branch.",
            "column": "To Do"
        },
        {
            "text": "Add url parameter 'import' to be used with GitHub raw link and import json exports sotred in a GitHub project. - [DONE Note: Don't use the \"/ref/head/main/\" url, it lacks behind, use the \"/main/\" only url]",
            "column": "Done"
        },
        {
            "text": "Add browser local storage caching to prevent losing work in progress.",
            "column": "Done"
        },
        {
            "text": "Add a clear board option, either a button or as a sandwich menu item, to clear the board content and cached state in the browser e local store.",
            "column": "Done"
        },
        {
            "text": "Buy a proper domain name and setup DNS",
            "column": "Done"
        },
        {
            "text": "Create GitHub pages page for the project",
            "column": "Done"
        },
        {
            "text": "Add feedback button in the sandwitch menu and link it to a google form.",
            "column": "Done"
        },
        {
            "text": "Investigate how to fix cursor not moving while on mouse click in the text, while editing an item. [DONE Note: Made \"grabbable\" only the area around the typing field]",
            "column": "Done"
        }
    ]
}